package yaroslav_shelest.lesson.dz2;

import java.util.Arrays;
import java.util.Random;
import java.util.Scanner;

public class dz3 {
    private static Scanner scanner = new Scanner(System.in);   // создание объекта класса Scanner
    private static Random rand = new Random();                 // создание объекта класса Random

    public static void main(String[] args) {

        System.out.println("Задание 1");
        System.out.println("Написать программу, которая загадывает случайное число от 0 до 9 и пользователю \n" +
                "дается 3 попытки угадать это число. При каждой попытке компьютер должен сообщить, больше ли \n" +
                "указанное пользователем число, чем загаданное, или меньше. После победы или проигрыша выводится \n" +
                "запрос – «Повторить игру еще раз? 1 – да / 0 – нет»(1 – повторить, 0 – нет).");
        int b = 1;   //     присваивание элемента для запуска игры в методе guessNumber(b)
        guessNumber(b);   // метод, в котором находится игра с угадыванием числа

        System.out.println("Задание 2");
        System.out.println("Создать массив из слов\n" +
                "String[] words = {\"apple\", \"orange\", \"lemon\", \"banana\", \"apricot\", \"avocado\", \"broccoli\", \"carrot\", \"cherry\", \"garlic\", \"grape\", \"melon\", \"leak\", \"kiwi\", \"mango\", \"mushroom\", \"nut\", \"olive\", \"pea\", \"peanut\", \"pear\", \"pepper\", \"pineapple\", \"pumpkin\", \"potato\"}.\n" +
                "При запуске программы компьютер загадывает слово, запрашивает ответ у пользователя, сравнивает его с загаданным словом и сообщает, правильно ли ответил пользователь. Если слово не угадано, компьютер показывает буквы, которые стоят на своих местах.\n" +
                "apple – загаданное\n" +
                "apricot - ответ игрока\n" +
                "ap############# (15 символов, чтобы пользователь не мог узнать длину слова)\n" +
                "Для сравнения двух слов посимвольно можно пользоваться:\n" +
                "String str = \"apple\";\n" +
                "char a = str.charAt(0); - метод, вернет char, который стоит в слове str на первой позиции\n" +
                "Играем до тех пор, пока игрок не отгадает слово.\n" +
                "Используем только маленькие буквы.");
        String[] words = {"apple", "orange", "lemon", "banana",                   // создаем массив слов для игры
                "apricot", "avocado", "broccoli", "carrot", "cherry", "garlic",
                "grape", "melon", "leak", "kiwi", "mango", "mushroom", "nut",
                "olive", "pea", "peanut", "pear", "pepper", "pineapple",
                "pumpkin", "potato"};
        guessWord(words, b);                                                        // метод, в котором находится игра с угадыванием числа
        scanner.close();                                                         // закрываем сканер
    }
    // Задание 1
        public static void guessNumber(int b) {
            do {                                                                // запускаем цикл, который спрашивает хотим ли мы играть
                if (b == 1) {                                                   // если b=1 игра запускается
                    int i = 0;                                                  // задаем число, с которого начинается количество попыток
                    int x = rand.nextInt(10);                            // выбирается произвольно число [0;10)
                    while (i < 4) {                                            // запуск цикла с количеством попыток
                        System.out.println("Введите число от 0 до 10");
                        int c = scanner.nextInt();                              // сканер для опредения числа, котого вы ввели
                        if (x == c) {                                           // условие, при котором загаданное число овподает с введенным
                            System.out.println("Вы угадали число");
                            b = repeatGame();                                   // метод, в котором определяется хотите вы играть еще раз или нет
                            break;                                              // выход из цикла
                        }
                        if (i == 2) {                                           // условие, при котором вы проигрываете после 3 попытки
                            System.out.println("Вы проиграли");
                            b = repeatGame();                                   // метод, в котором определяется хотите вы играть еще раз или нет
                            break;                                              // выход из цикла
                        }
                        if (x < c) {                                            // условие, при котором вы не угадали число и игра дает подскажку что загаданное число меньше
                            System.out.println("Загаданное число меньше");
                        }
                        if (x > c) {
                            System.out.println("Загаданное число больше");      // условие, при котором вы не угадали число и игра дает подскажку что загаданное число больше
                        }
                        int z = 2 - i;                                          // определение оставшихся количества попыток
                        System.out.println("У вас осталось " + z + " попытки");
                        i++;                                                    // сложение использьзованных попыток
                    }
                } else if (b == 0){                                             // условие при котором вы выходите из игры
                    System.out.println("Игра закончина");
                    break;                                                      // выход из цикла
                }
            } while (true);
        }

    // Задание 2
    public static void guessWord(String[] words, int b) {
        do {                                                                   // запускаем цикл, который спрашивает хотим ли мы играть
            if (b == 1) {                                                      // если b=1 игра запускается
                int x = rand.nextInt(words.length);                            // выбирается произвольно число в массиве
                do {                                                           // запуск цикла, в котором надо угадать слово
                    System.out.println("Введите слово");
                    Scanner sc = new Scanner(System.in);
                    String str = sc.nextLine();                                // сканер для опредения слова, котого вы ввели
                    String[] arr = new String[15];                             // создаем массив для того, чтобы вбить #
                    for (int f = 0; f < arr.length; f++) {                     // создаем итерацию, где в каждый элемент вставляется #
                        arr[f] = "#";
                    }
                    int f = 0;                                                 // создаем значение благодаря которму опрделяется угадали ли мы слово
                    if (words[x].length() == str.length()) {                   // условие при котором длины слов равны загаданного и введенного
                        for (int v = 0; v < words[x].length(); v++) {          // запускаем итерацию, при которм сравниваются буквы в каждом слове
                            char a = str.charAt(v);                            //
                            char d = words[x].charAt(v);
                            if (a == d) {                                      // условие, при котором буква в загадонном слове в каждой итерции совпадает с введенным
                                f = f + 1;                                     // если условие верно, то к f прибавляется 1
                            }
                        }
                    }
                    String j = "";                                             // создаем знаение, которое будет выводить загаданное слово
                    if (f == words[x].length()) {                              // условие, при котором количество совпадений загаданным словом с введенным равно количеству букву в загаданном слове
                        for (int v = 0; v < words[x].length(); v++) {          // создаем цикл благодаря которому будет создаваться слово угаданное
                            String h = Character.toString(words[x].charAt(v)); // каждую букву в загаданном слове мы переносим из char в String
                            j = j + h;                                         // прибавляем каждую букву в итерации
                        }
                        System.out.println("Вы угадали слово " + j);
                        b = repeatGame();                                      // метод, в котором определяется хотите вы играть еще раз или нет
                        break;                                                 // выход из цикла
                    }
                    for (int v = 0; v < words[x].length(); v++) {              // создаем цикл, где определяются какие буквы совпадают у загаданного с введенным
                        for (int c = 0; c < str.length(); c++) {
                            char a = str.charAt(c);
                            if (words[x].charAt(v) == a) {                     // условие, при котором какая то буква введенного слова совпадает с загаданным
                                String d = Character.toString(a);              // переводим эту буквы из char в String
                                arr[v] = d;                                    // и подставляем в массив arr в зависимости от месторасположения буквы в загадонном слове
                            }
                        }
                    }
                    System.out.println(Arrays.toString(arr));                  // вывод в консоль подсказки, какие буквы совпали
                } while(true);
            }
            else if (b == 0){                                                  // условие при котором вы выходите из игры
                System.out.println("Игра закончина");
                break;                                                         // выход из цикла
            }
        } while (true);
    }

    public static int repeatGame() {                                          // метод, который спрашивает, хотите ли вы повторить игру
        System.out.println("Повторить игру еще раз? 1 – да / 0 – нет");
        int b = scanner.nextInt();                                            // определяет введенное вами чило
        return b;                                                             // возвращает значение
    }
}