package yaroslav_shelest.lesson.dz1;

import java.util.Scanner;

public class Eight {
    public static void main(String[] args) {
        System.out.println("Задание 8"); // печатается номер задания в консоль
        Scanner scanner = new Scanner(System.in); //Создаем объект класса Scanner
        // и связываем его с клавиатурой для ввода данных с клавиатуры
        System.out.println("Введите год"); // печатается информирующий текст в консоль
        int a = scanner.nextInt(); // сканирует следующий токен ввода как Int
        calculate(a); // вызов метода напечатает результат в консоль
    }

    public static void calculate(int a) { // метод ничего не возвращает
        float b = (float)a / 4; // определяем значение со знаками после запятой
        float d = (float)a / 100; // определяем значение со знаками после запятой
        float f = (float)a / 400; // определяем значение со знаками после запятой
        int c = a / 4; // определяем целое число
        int e = a / 100; // определяем целое число
        int g = a / 400; // определяем целое число
        if ((b-c == 0 && d-e != 0) || f-g == 0) { // если остатка нет, когда делем число на 4,
            // и число при делении 25 не равно 0 или если остатка нет, когда делем число на 400, то год вискокосный
            System.out.println(a + " високосный год"); // печатается результат работы метода
        } else {
            System.out.println(a + " невисокосный год"); // печатается результат работы метода
        }
    }
}
