package yaroslav_shelest.lesson.dz1;

public class Two {
    public static void main(String[] args) {
        System.out.println("Задание 2"); // печатается номер задания в консоль
        byte a = -126; // объявление переменной с инициализацией
        short b = 5300; // объявление переменной с инициализацией
        int c = -7800; // объявление переменной с инициализацией
        long e = 206531654L; // объявление переменной с инициализацией
        float f = 3.14f; // объявление переменной с инициализацией
        double g = -145.913; // объявление переменной с инициализацией
        char h = 67; // объявление переменной с инициализацией
        boolean i = true; // объявление переменной с инициализацией
    }
}
